rocksdb/experiments/M2/results/20260429-025838/budget_on/run_2/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 03:05:23 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777431923280003 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       9.046 micros/op 110541 ops/sec 45.232 seconds 5000000 operations;  109.6 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      12.918 micros/op 77414 ops/sec 64.588 seconds 5000000 operations;   76.8 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      13.934 micros/op 71764 ops/sec 69.672 seconds 5000000 operations;   71.2 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0     16/0   996.44 MB   4.0      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    475.4     31.44             25.51       240    0.131       0      0       0.0       0.0
  L1     18/1    1.07 GB   4.1     25.9    13.6     12.3      22.9     10.6       0.0   1.7    252.3    223.0    105.03             90.75        19    5.528     26M  3051K       0.0       0.0
  L2     90/3    4.51 GB   1.8     20.8     9.0     11.8      15.8      3.9       0.6   1.8    305.2    231.3     69.85             59.17       129    0.541     21M  5132K       0.0       0.0
 Sum    124/4    6.55 GB   0.0     46.7    22.6     24.1      53.2     29.2       0.6   3.6    231.8    264.3    206.32            175.43       388    0.532     47M  8184K       0.0       0.0
 Int      0/0    0.00 KB   0.0     46.7    22.6     24.1      53.0     28.9       0.6   3.7    232.3    263.7    205.82            175.02       384    0.536     47M  8184K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     46.7    22.6     24.1      38.7     14.6       0.0   0.0    273.4    226.3    174.88            149.92       148    1.182     47M  8184K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    475.4     31.44             25.51       240    0.131       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 179.5 total, 176.5 interval
Flush(GB): cumulative 14.598, interval 14.354
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 53.25 GB write, 303.77 MB/s write, 46.69 GB read, 266.38 MB/s read, 206.3 seconds
Interval compaction: 53.01 GB write, 307.53 MB/s write, 46.69 GB read, 270.92 MB/s read, 205.8 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 20, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 20, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 20, total-stops: 0
interval: 20 total count
Block cache LRUCache@0x5623b8914df0#80466 capacity: 32.00 MB seed: 510019715 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000175 secs_since: 179
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 179.5 total, 176.5 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 84.16 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 84.16 MB/s
Cumulative stall: 00:00:54.726 H:M:S, 30.5 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14777.98 MB, 83.73 MB/s
Interval WAL: 14M writes, 0 syncs, 14674085.00 writes per sync, written: 14.43 GB, 83.73 MB/s
Interval stall: 00:00:54.726 H:M:S, 31.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0